PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_adc.c
/*!
    \file    gd32f3x0_hal_adc.c
    \brief   ADC driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f3x0_hal.h"

/* delaytime for ADC enable and disable, in milliseconds */
#define ADC_ENABLE_DELAYTIME                    ((uint32_t) 2U)
#define ADC_DISABLE_DELAYTIME                   ((uint32_t) 2U)
/* delaytime for temperature sensor stabilization time, in microseconds */
#define ADC_TEMPSENSOR_DELAYTIME                ((uint32_t) 10U)

/* enable ADC */
/* enable the ADC */
static int32_t _adc_enable(hal_adc_dev_struct *adc_dev);
/*disable the ADC */
static int32_t _adc_disable(hal_adc_dev_struct *adc_dev);
/* get the ADC enable state */
static FlagStatus _adc_enable_state_get(void);

/* DMA callback function */
/* ADC DMA full transmission complete callback */
static void _adc_dma_full_transfer_complete(void *dma);
/* ADC DMA half transmission complete callback */
static void _adc_dma_half_transfer_complete(void *dma);
/* ADC DMA error callback */
static void _adc_dma_error(void *dma);

/* get ADC state and error */
/* set ADC state */
static void _adc_state_set(hal_adc_dev_struct *adc_dev, hal_adc_state_enum adc_state);
/* clear ADC state */
static void _adc_state_clear(hal_adc_dev_struct *adc_dev, hal_adc_state_enum adc_state);
/* set ADC error */
static void _adc_error_set(hal_adc_dev_struct *adc_dev, hal_adc_error_enum adc_error);
/* clear ADC error */
static void _adc_error_clear(hal_adc_dev_struct *adc_dev, hal_adc_error_enum adc_error);

/*!
    \brief      initialize the ADC structure with the default values
    \param[in]  hal_struct_type: the argument could be selected from enumeration <hal_adc_struct_type_enum>
    \param[in]  p_struct: pointer to ADC structure that contains the configuration information
    \param[out] none
    \retval     none
*/
void hal_adc_struct_init(hal_adc_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == p_struct) {
        HAL_DEBUGE("pointer [*p_struct] value is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    switch(hal_struct_type) {
    case HAL_ADC_INIT_STRUCT:
        /* initialize ADC initialization structure with the default values */
        ((hal_adc_init_struct *)p_struct)->resolution                  = ADC_RESOLUTION_12B;
        ((hal_adc_init_struct *)p_struct)->data_alignment              = ADC_LSB_ALIGNMENT;
        ((hal_adc_init_struct *)p_struct)->scan_mode                   = DISABLE;
        ((hal_adc_init_struct *)p_struct)->hardware_oversampling       = DISABLE;
        ((hal_adc_init_struct *)p_struct)->oversample_trigger_mode     = ADC_OVERSAMPLING_ALL_CONVERT;
        ((hal_adc_init_struct *)p_struct)->oversampling_shift          = ADC_OVERSAMPLE_SHIFT_NONE;
        ((hal_adc_init_struct *)p_struct)->oversampling_ratio          = ADC_OVERSAMPLE_RATIO_MUL2;

        break;

    case HAL_ADC_ROUTINE_CONFIG_STRUCT:
        /* initialize ADC routine channel initialization structure with the default values */
        ((hal_adc_routine_config_struct *)p_struct)->routine_sequence_conversions                = DISABLE;
        ((hal_adc_routine_config_struct *)p_struct)->routine_sequence_length                     = 0U;
        ((hal_adc_routine_config_struct *)p_struct)->routine_sequence_external_trigger_select    = ADC_EXTTRIG_ROUTINE_NONE;
        ((hal_adc_routine_config_struct *)p_struct)->continuous_mode                             = DISABLE;
        ((hal_adc_routine_config_struct *)p_struct)->discontinuous_mode                          = DISABLE;
        ((hal_adc_routine_config_struct *)p_struct)->number_of_conversions_in_discontinuous_mode = 0U;
        break;

    case HAL_ADC_ROUTINE_RANK_CONFIG_STRUCT:
        /* initialize ADC routine channel configuration structure with the default values */
        ((hal_adc_routine_rank_config_struct *)p_struct)->channel          = 0U;
        ((hal_adc_routine_rank_config_struct *)p_struct)->routine_sequence = ADC_ROUTINE_SEQUENCE_0;
        ((hal_adc_routine_rank_config_struct *)p_struct)->sampling_time    = ADC_SAMPLETIME_1POINT5;
        break;

    case HAL_ADC_INSERTED_CONFIG_STRUCT:
        /* initialize ADC inserted channel initialization structure with the default values */
        ((hal_adc_inserted_config_struct *)p_struct)->inserted_sequence_conversions             = DISABLE;
        ((hal_adc_inserted_config_struct *)p_struct)->inserted_sequence_length                  = 0U;
        ((hal_adc_inserted_config_struct *)p_struct)->inserted_sequence_external_trigger_select = ADC_EXTTRIG_ROUTINE_NONE;
        ((hal_adc_inserted_config_struct *)p_struct)->auto_convert                              = DISABLE;
        ((hal_adc_inserted_config_struct *)p_struct)->discontinuous_mode                        = DISABLE;
        break;

    case HAL_ADC_INSERTED_RANK_CONFIG_STRUCT:
        /* initialize ADC inserted channel configuration structure with the default values */
        ((hal_adc_inserted_rank_config_struct *)p_struct)->channel           = 0U;
        ((hal_adc_inserted_rank_config_struct *)p_struct)->inserted_sequence = ADC_INSERTED_SEQUENCE_0;
        ((hal_adc_inserted_rank_config_struct *)p_struct)->sampling_time     = ADC_SAMPLETIME_1POINT5;
        ((hal_adc_inserted_rank_config_struct *)p_struct)->data_offset       = 0U;
        break;

    case HAL_ADC_IRQ_STRUCT:
        /* initialize ADC device interrupt callback function pointer structure with the default values */
        ((hal_adc_irq_struct *)p_struct)->adc_watchdog_handle = NULL;
        ((hal_adc_irq_struct *)p_struct)->adc_eoc_handle      = NULL;
        ((hal_adc_irq_struct *)p_struct)->adc_eoic_handle     = NULL;
        break;

    case HAL_ADC_DMA_HANDLE_CB_STRUCT:
        /* initialize ADC DMA callback function pointer structure with the default values */
        ((hal_adc_dma_handle_cb_struct *)p_struct)->full_transcom_handle = NULL;
        ((hal_adc_dma_handle_cb_struct *)p_struct)->half_transcom_handle = NULL;
        ((hal_adc_dma_handle_cb_struct *)p_struct)->error_handle         = NULL;
        break;

    case HAL_ADC_WATCHDOG_CONFIG_STRUCT:
        /* initialize ADC watchdog configuration structure with the default values */
        ((hal_adc_watchdog_config_struct *)p_struct)->routine_sequence_analog_watchdog  = DISABLE;
        ((hal_adc_watchdog_config_struct *)p_struct)->inserted_sequence_analog_watchdog = DISABLE;
        ((hal_adc_watchdog_config_struct *)p_struct)->analog_watchdog_mode              = ADC_OVERSAMPLING_ALL_CONVERT;
        ((hal_adc_watchdog_config_struct *)p_struct)->analog_watchdog_channel_select    = ADC_CHANNEL_0;
        ((hal_adc_watchdog_config_struct *)p_struct)->analog_watchdog_high_threshold    = 0U;
        ((hal_adc_watchdog_config_struct *)p_struct)->analog_watchdog_low_threshold     = 0U;
        break;

    case HAL_ADC_DEV_STRUCT:
        /* initialize ADC device information structure with the default values */
        ((hal_adc_dev_struct *)p_struct)->adc_irq.adc_eoc_handle       = NULL;
        ((hal_adc_dev_struct *)p_struct)->adc_irq.adc_eoic_handle      = NULL;
        ((hal_adc_dev_struct *)p_struct)->adc_irq.adc_watchdog_handle  = NULL;
        ((hal_adc_dev_struct *)p_struct)->p_dma_adc                    = NULL;
        ((hal_adc_dev_struct *)p_struct)->adc_dma.full_transcom_handle = NULL;
        ((hal_adc_dev_struct *)p_struct)->adc_dma.half_transcom_handle = NULL;
        ((hal_adc_dev_struct *)p_struct)->adc_dma.error_handle         = NULL;
        ((hal_adc_dev_struct *)p_struct)->error_state                  = HAL_ADC_ERROR_NONE;
        ((hal_adc_dev_struct *)p_struct)->state                        = HAL_ADC_STATE_RESET;
        break;

    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      deinitialize ADC device structure and init structure
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_deinit(hal_adc_dev_struct *adc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    _adc_state_set(adc_dev, HAL_ADC_STATE_BUSY_SYSTEM);

    /* if ADC is disabled */
    if(HAL_ERR_NONE == _adc_disable(adc_dev)) {
        /* deinit ADC */
        hals_adc_deinit();
        adc_dev->error_state = HAL_ADC_ERROR_NONE;
        adc_dev->state = HAL_ADC_STATE_RESET;
    } else {
        return HAL_ERR_HARDWARE;
    }

