PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_adc.c
    return HAL_ERR_NONE;
}

/*!
    \brief      initialize ADC
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_init: the pointer of ADC init structure
                  resolution_select:
                  only one parameter can be selected which is shown as below:
      \arg          ADC_RESOLUTION_12B: 12-bit ADC resolution
      \arg          ADC_RESOLUTION_10B: 10-bit ADC resolution
      \arg          ADC_RESOLUTION_8B : 8-bit ADC resolution
      \arg          ADC_RESOLUTION_6B : 6-bit ADC resolution
                  data_alignment:
                  only one parameter can be selected which is shown as below:
      \arg          ADC_LSB_ALIGNMENT: LSB alignment
      \arg          ADC_MSB_ALIGNMENT: MSB alignment
                  scan_mode: ENABLE, DISABLE
                  only one parameter can be selected which is shown as below:
      \arg          ENABLE: enable scan mode
      \arg          DISABLE: disable scan mode
                  oversample_config:
                    the argument could be selected from structure <hal_adc_oversample_struct>
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_init(hal_adc_dev_struct *adc_dev, hal_adc_init_struct *p_init)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc_dev) || (NULL == p_init)) {
        HAL_DEBUGE("pointer [adc_dev] or [p_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    if(HAL_ADC_STATE_RESET == (hal_adc_state_get(adc_dev))) {
        adc_dev->error_state = HAL_ADC_ERROR_NONE;
    }

    if((HAL_ERR_NONE == _adc_disable(adc_dev)) &&
            (RESET == ((hal_adc_error_get(adc_dev)) & HAL_ADC_ERROR_SYSTEM))) {
        /* set ADC state  */
        _adc_state_clear(adc_dev, HAL_ADC_STATE_ROUTINE_BUSY);
        _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
        _adc_state_set(adc_dev, HAL_ADC_STATE_BUSY_SYSTEM);

        /* init ADC */
        /* 1.ADC data resolution select */
        /* ADC data resolution select can be updated only when ADC is disabled*/
        if(RESET == _adc_enable_state_get()) {
            hals_adc_resolution_config(p_init->resolution);
        }
        /* 2.ADC data alignment config */
        hals_adc_data_alignment_config(p_init->data_alignment);

        /* 3.ADC scan mode config */
        hals_adc_special_function_config(ADC_SCAN_MODE, p_init->scan_mode);

        /* 4.ADC oversampling mode config */
        if(ENABLE == p_init->hardware_oversampling) {
            hals_adc_oversample_mode_config(p_init->oversample_trigger_mode, p_init->oversampling_shift,
                                            p_init->oversampling_ratio);
            /* enable ADC oversample mode */
            hals_adc_oversample_mode_enable();
        } else {
            if(SET == __HAL_ADC_GET_OVERSAMPLE_ENABLE) {
                /* disable ADC oversample mode */
                hals_adc_oversample_mode_disable();
            }
        }
    } else {
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      ADC calibration
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_calibration_start(hal_adc_dev_struct *adc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* if ADC is disabled */
    if(HAL_ERR_NONE == _adc_disable(adc_dev)) {
        /* set ADC state  */
        _adc_state_clear(adc_dev, HAL_ADC_STATE_ROUTINE_BUSY);
        _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
        _adc_state_set(adc_dev, HAL_ADC_STATE_BUSY_SYSTEM);

        /* enable the ADC */
        _adc_enable(adc_dev);
        /* ADC calibration and reset calibration */
        hals_adc_calibration_enable();

        /* set ADC state  */
        _adc_state_clear(adc_dev, HAL_ADC_STATE_BUSY_SYSTEM);
        _adc_state_set(adc_dev, HAL_ADC_STATE_READY);
    } else {
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      initialize ADC routine channel
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_rchannel: the pointer of ADC routine sequence init structure
                  routine_sequence_conversions:
                  only one parameter can be selected which is shown as below:
      \arg          ENABLE: enable external trigger
      \arg          DISABLE: disable external trigger
                  routine_sequence_length: 1-16
                  routine_sequence_external_trigger_select:
                  only one parameter can be selected which is shown as below:
      \arg          ADC_EXTTRIG_ROUTINE_T0_CH0: TIMER0 CH0 event select
      \arg          ADC_EXTTRIG_ROUTINE_T0_CH1: TIMER0 CH1 event select
      \arg          ADC_EXTTRIG_ROUTINE_T0_CH2: TIMER0 CH2 event select
      \arg          ADC_EXTTRIG_ROUTINE_T1_CH1: TIMER1 CH1 event select
      \arg          ADC_EXTTRIG_ROUTINE_T2_TRGO: TIMER2 TRGO event select
      \arg          ADC_EXTTRIG_ROUTINE_T14_CH0: TIMER14 CH0 event select
      \arg          ADC_EXTTRIG_ROUTINE_EXTI_11: external interrupt line 11
      \arg          ADC_EXTTRIG_ROUTINE_NONE: software trigger
                  continuous_mode:
                  only one parameter can be selected which is shown as below:
      \arg          ENABLE: enable continuous mode
      \arg          DISABLE: disable continuous mode
                  discontinuous_mode:
                  only one parameter can be selected which is shown as below:
      \arg          ENABLE: enable continuous
      \arg          DISABLE: disable continuous
                  number_of_conversions_in_discontinuous_mode: 1-8
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_routine_channel_config(hal_adc_dev_struct *adc_dev, hal_adc_routine_config_struct *p_rchannel)
{
    uint32_t reg_temp;

