PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_adc.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc_dev) || (NULL == p_rchannel)) {
        HAL_DEBUGE("pointer [adc_dev] or [p_rinit] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    if(HAL_ADC_STATE_RESET == (hal_adc_state_get(adc_dev))) {
        adc_dev->error_state = HAL_ADC_ERROR_NONE;
    }

    if((HAL_ERR_NONE == _adc_disable(adc_dev)) &&
            (RESET == ((hal_adc_error_get(adc_dev)) & HAL_ADC_ERROR_SYSTEM)) &&
            (ENABLE == (p_rchannel->routine_sequence_conversions))) {
        /* set ADC state  */
        _adc_state_clear(adc_dev, HAL_ADC_STATE_ROUTINE_BUSY);
        _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
        _adc_state_set(adc_dev, HAL_ADC_STATE_BUSY_SYSTEM);
        /* init ADC routine channel */
        /* 1.ADC channel length config */
        hals_adc_channel_length_config(ADC_ROUTINE_CHANNEL, p_rchannel->routine_sequence_length);
        /* 2.ADC routine channel external trigger config */
        hals_adc_external_trigger_source_config(ADC_ROUTINE_CHANNEL,
                                                p_rchannel->routine_sequence_external_trigger_select);

        /* 3.ADC continuous mode config */
        hals_adc_special_function_config(ADC_CONTINUOUS_MODE, p_rchannel->continuous_mode);
        /* 4.ADC discontinuous mode config */
        if(ENABLE == p_rchannel->discontinuous_mode) {
            if(DISABLE == p_rchannel->continuous_mode) {
                reg_temp = ADC_CTL0;
                /* clear DISRC bit and DISNUM bit */
                reg_temp &= ~((uint32_t)ADC_CTL0_DISRC);
                reg_temp &= ~((uint32_t)ADC_CTL0_DISNUM);
                reg_temp |= CTL0_DISNUM(((uint32_t)(p_rchannel->number_of_conversions_in_discontinuous_mode) - 1U));
                reg_temp |= (uint32_t)ADC_CTL0_DISRC;
                ADC_CTL0 = reg_temp;
            } else {
                ADC_CTL0 &= ~((uint32_t)ADC_CTL0_DISRC);
                _adc_error_set(adc_dev, HAL_ADC_ERROR_CONFIG);
                _adc_error_set(adc_dev, HAL_ADC_ERROR_SYSTEM);
            }
        } else {
            reg_temp = ADC_CTL0;
            reg_temp &= ~(uint32_t)ADC_CTL0_DISRC;
            ADC_CTL0 = reg_temp;
        }
    } else {
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      configure ADC routine channel
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_rrank: the pointer of ADC routine channel configuration structure
                  channel: ADC_CHANNEL_x(x=0..18)
                  routine_sequence:
                    the argument could be selected from enumeration <hal_adc_routine_sequence_enum>
                  sampling_time:
        \arg        ADC_SAMPLETIME_1POINT5: 1.5 cycles
        \arg        ADC_SAMPLETIME_7POINT5: 7.5 cycles
        \arg        ADC_SAMPLETIME_13POINT5: 13.5 cycles
        \arg        ADC_SAMPLETIME_28POINT5: 28.5 cycles
        \arg        ADC_SAMPLETIME_41POINT5: 41.5 cycles
        \arg        ADC_SAMPLETIME_55POINT5: 55.5 cycles
        \arg        ADC_SAMPLETIME_71POINT5: 71.5 cycles
        \arg        ADC_SAMPLETIME_239POINT5: 239.5 cycles
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_routine_rank_config(hal_adc_dev_struct *adc_dev, hal_adc_routine_rank_config_struct *p_rrank)
{
    __IO uint32_t wait_loop = 0;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc_dev) || (NULL == p_rrank)) {
        HAL_DEBUGE("pointer [adc_dev] or [p_rchannel] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* configure ADC routine channel */
    hals_adc_routine_channel_config(p_rrank->routine_sequence, p_rrank->channel,
                                    p_rrank->sampling_time);

    /* enable temperature sensor and VREFINT measurement */
    if((ADC_CHANNEL_TEMPSENSOR == p_rrank->channel) ||
            (ADC_CHANNEL_VREFINT == p_rrank->channel)) {
        if(RESET == __HAL_ADC_GET_TEMPVREF_ENABLE) {
            /* enable the temperature sensor and Vrefint channel */
            ADC_CTL1 |= ADC_CTL1_TSVREN;
            if(ADC_CHANNEL_TEMPSENSOR == p_rrank->channel) {
                /* compute number of CPU cycles to wait for */
                wait_loop = (ADC_TEMPSENSOR_DELAYTIME * (g_systemcoreclock / 1000000));
                /* delay for temperature sensor stabilization time */
                while(wait_loop != 0) {
                    wait_loop--;
                }
            }
        }
    }
    /* enable backup battery voltage measurement */
    if(ADC_CHANNEL_BATTERY == p_rrank->channel) {
        if(RESET == __HAL_ADC_GET_BATTERY_ENABLE) {
            /* enable the temperature sensor and Vrefint channel */
            ADC_CTL1 |= ADC_CTL1_VBETEN;
        }
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      enable ADC and start the conversion of routine sequence
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_start(hal_adc_dev_struct *adc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* if ADC is enabled */
    if(HAL_ERR_NONE == _adc_enable(adc_dev)) {
        _adc_state_clear(adc_dev, HAL_ADC_STATE_READY);
        _adc_state_clear(adc_dev, HAL_ADC_STATE_ROUTINE_EOC);
        _adc_state_set(adc_dev, HAL_ADC_STATE_ROUTINE_BUSY);

