PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_adc.c
        /* if ADC configured in automatic inserted mode */
        if(SET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV) {
            _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_EOC);
            _adc_state_set(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
        }

        if(SET == ((hal_adc_state_get(adc_dev)) & HAL_ADC_STATE_INSERTED_BUSY)) {
            _adc_error_clear(adc_dev, HAL_ADC_ERROR_DMA);
        } else {
            adc_dev->error_state = HAL_ADC_ERROR_NONE;
        }

        /* clear ADC flag */
        hals_adc_flag_clear(ADC_FLAG_EOC);

        /* enable conversion of routine sequence */
        if(ADC_EXTTRIG_ROUTINE_NONE == __HAL_ADC_GET_ROUTINECH_EXTTRIGGER) {
            /* enable software trigger */
            hals_adc_external_trigger_config(ADC_ROUTINE_CHANNEL, ENABLE);
            hals_adc_software_trigger_enable(ADC_ROUTINE_CHANNEL);
        } else {
            /* enable external trigger */
            hals_adc_external_trigger_config(ADC_ROUTINE_CHANNEL, ENABLE);
        }
    } else {
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      stop the conversion of routine sequence and disable ADC
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_stop(hal_adc_dev_struct *adc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* if ADC is disabled */
    if(HAL_ERR_NONE == _adc_disable(adc_dev)) {
        _adc_state_clear(adc_dev, HAL_ADC_STATE_ROUTINE_BUSY);
        _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
        _adc_state_set(adc_dev, HAL_ADC_STATE_READY);
    } else {
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      polling for ADC routine sequence conversion, this function is just for single conversion
                (scan mode disabled or scan mode enabled with the length of routine channel is 1)
    \param[in]  adc_dev: ADC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: time out duration in milliscond
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_routine_conversion_poll(hal_adc_dev_struct *adc_dev, uint32_t timeout_ms)
{
    uint32_t tick_start = 0;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* lock ADC */
    HAL_LOCK(adc_dev);

    /* if ADC configured in DMA mode */
    if(SET == __HAL_ADC_GET_DMA_MODE) {
        _adc_error_set(adc_dev, HAL_ADC_ERROR_CONFIG);
        return HAL_ERR_NO_SUPPORT;
    }

    /* set timeout */
    tick_start = hal_sys_basetick_count_get();

    /* if single conversion: scan mode disabled or enabled with length = 1 */
    if((RESET == __HAL_ADC_GET_SCAN_MODE) && (RESET == __HAL_ADC_GET_ROUTINECH_LENGTH)) {
        /* wait until end of conversion flag is raised */
        while(RESET == hals_adc_flag_get(ADC_FLAG_EOC)) {
            /* check for the timeout */
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    _adc_state_set(adc_dev, HAL_ADC_STATE_TIMEOUT);
                    /* when timeout occurs, output timeout warning message */
                    HAL_DEBUGW("adc_dev routine conversion poll timeout");
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    } else {
        return HAL_ERR_NO_SUPPORT;
    }

    /* clear ADC EOC flag and STRC flag */
    hals_adc_flag_clear(ADC_FLAG_EOC);
    hals_adc_flag_clear(ADC_FLAG_STRC);

    /* set ADC states */
    _adc_state_set(adc_dev, HAL_ADC_STATE_ROUTINE_EOC);
    if((ADC_EXTTRIG_ROUTINE_NONE == __HAL_ADC_GET_ROUTINECH_EXTTRIGGER) &&
            (DISABLE == __HAL_ADC_GET_CONTINUOUS_MODE)) {
        _adc_state_clear(adc_dev, HAL_ADC_STATE_ROUTINE_BUSY);
        if(RESET == ((hal_adc_state_get(adc_dev)) & HAL_ADC_STATE_INSERTED_BUSY)) {
            _adc_state_set(adc_dev, HAL_ADC_STATE_READY);
        }
    }

    /* unlock ADC */
    HAL_UNLOCK(adc_dev);

    return HAL_ERR_NONE;
}

/*!
    \brief      enable ADC routine sequence software trigger
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_adc_routine_software_trigger_enable(hal_adc_dev_struct *adc_dev)
{
    hals_adc_software_trigger_enable(ADC_ROUTINE_CHANNEL);
}

/*!
    \brief      start ADC EOC interrupt
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: EOC interrupt callback function structure
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_start_interrupt(hal_adc_dev_struct *adc_dev, hal_adc_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [adc_dev] or [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* lock ADC */
    HAL_LOCK(adc_dev);

