PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_adc.c
    /* if ADC is enabled */
    if(HAL_ERR_NONE == _adc_enable(adc_dev)) {
        /* set ADC state */
        _adc_state_clear(adc_dev, HAL_ADC_STATE_READY);
        _adc_state_clear(adc_dev, HAL_ADC_STATE_ROUTINE_EOC);
        _adc_state_set(adc_dev, HAL_ADC_STATE_ROUTINE_BUSY);

        /* if ADC configured in automatic inserted mode */
        if(SET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV) {
            _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_EOC);
            _adc_state_set(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
        }
        /* check if an inserted conversion is ongoing */
        if(SET == ((hal_adc_state_get(adc_dev)) & HAL_ADC_STATE_INSERTED_BUSY)) {
            _adc_error_clear(adc_dev, HAL_ADC_ERROR_DMA);
        } else {
            adc_dev->error_state = HAL_ADC_ERROR_NONE;
        }

        adc_dev->adc_irq.adc_eoc_handle = p_irq->adc_eoc_handle;

        /* clear ADC interrupt flag */
        hals_adc_interrupt_flag_clear(ADC_INT_FLAG_EOC);
        /* enable ADC end of sequence conversion flag */
        hals_adc_interrupt_enable(ADC_INT_EOC);
        /* enable the conversion of routine sequence */
        if(ADC_EXTTRIG_ROUTINE_NONE == __HAL_ADC_GET_ROUTINECH_EXTTRIGGER) {
            /* enable software trigger */
            hals_adc_external_trigger_config(ADC_ROUTINE_CHANNEL, ENABLE);
            hals_adc_software_trigger_enable(ADC_ROUTINE_CHANNEL);
        } else {
            /* enable external trigger */
            hals_adc_external_trigger_config(ADC_ROUTINE_CHANNEL, ENABLE);
        }
    } else {
        return HAL_ERR_HARDWARE;
    }

    /* unlock ADC */
    HAL_UNLOCK(adc_dev);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop ADC EOC interrupt
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_stop_interrupt(hal_adc_dev_struct *adc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* if ADC is disabled */
    if(HAL_ERR_NONE == _adc_disable(adc_dev)) {
        /* end of sequence conversion interrupt */
        hals_adc_interrupt_disable(ADC_INT_EOC);
        adc_dev->adc_irq.adc_eoc_handle = NULL;

        /* set ADC state */
        _adc_state_clear(adc_dev, HAL_ADC_STATE_ROUTINE_BUSY);
        _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
        _adc_state_set(adc_dev, HAL_ADC_STATE_READY);
    } else {
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      enable ADC and start the conversion of routine sequence with DMA
    \param[in]  adc_dev: ADC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  pdata: the source memory buffer address
    \param[in]  length: the number of data to be transferred from source to destination
    \param[in]  dmacb: ADC DMA transfer complete interrupt callback function structure
                  transcom_handle: DMA transfer complete interrupt handler
                  error_handle: ADC DMA error interrupt handler
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_HARDWARE, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_start_dma(hal_adc_dev_struct *adc_dev, uint32_t *pdata, uint32_t length, hal_adc_dma_handle_cb_struct *dmacb)
{
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc_dev) || (NULL == pdata) || (NULL == dmacb)) {
        HAL_DEBUGE("pointer [adc_dev] or [pdata] or [dmacb] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(0U == length) {
        HAL_DEBUGE("parameter [length] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* lock ADC */
    HAL_LOCK(adc_dev);

    hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);

    /* if ADC is enabled */
    if(HAL_ERR_NONE == _adc_enable(adc_dev)) {
        /* set ADC state */
        _adc_state_clear(adc_dev, HAL_ADC_STATE_READY);
        _adc_state_clear(adc_dev, HAL_ADC_STATE_ROUTINE_EOC);
        _adc_state_set(adc_dev, HAL_ADC_STATE_ROUTINE_BUSY);

        /* if conversions on routine sequence are also triggering inserted sequence */
        if(SET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV) {
            _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_EOC);
            _adc_state_set(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
        }
        /* check if an inserted conversion is ongoing */
        if(SET == ((hal_adc_state_get(adc_dev)) & HAL_ADC_STATE_INSERTED_BUSY)) {
            _adc_error_clear(adc_dev, HAL_ADC_ERROR_DMA);
        } else {
            adc_dev->error_state = HAL_ADC_ERROR_NONE;
        }

        /* clear ADC flag */
        hals_adc_flag_clear(ADC_FLAG_EOC);

        adc_dev->adc_dma.full_transcom_handle = dmacb->full_transcom_handle;
        adc_dev->adc_dma.half_transcom_handle = dmacb->half_transcom_handle;
        adc_dev->adc_dma.error_handle    = dmacb->error_handle;

        /* set the DMA transfer complete callback */
        dma_irq.full_finish_handle = _adc_dma_full_transfer_complete;
        dma_irq.half_finish_handle = _adc_dma_half_transfer_complete;
        dma_irq.error_handle       = _adc_dma_error;

        /* enable ADC DMA mode */
        hals_adc_dma_mode_enable();
        /* start the DMA channel */
        hal_dma_start_interrupt(adc_dev->p_dma_adc, (uint32_t)&ADC_RDATA, (uint32_t)pdata, length,
                                &dma_irq);

