PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_adc.c
        /* enable the conversion of routine sequence */
        if(ADC_EXTTRIG_ROUTINE_NONE == __HAL_ADC_GET_ROUTINECH_EXTTRIGGER) {
            /* enable software trigger */
            hals_adc_external_trigger_config(ADC_ROUTINE_CHANNEL, ENABLE);
            hals_adc_software_trigger_enable(ADC_ROUTINE_CHANNEL);

        } else {
            /* enable external trigger */
            hals_adc_external_trigger_config(ADC_ROUTINE_CHANNEL, ENABLE);
        }
    } else {
        return HAL_ERR_HARDWARE;
    }

    /* unlock ADC */
    HAL_UNLOCK(adc_dev);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop the conversion of routine sequence, disable ADC DMA mode and disable ADC
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_stop_dma(hal_adc_dev_struct *adc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* if ADC is enabled */
    if(HAL_ERR_NONE == _adc_disable(adc_dev)) {
        /* disable ADC DMA mode */
        hals_adc_dma_mode_disable();
        /* disable the DMA channel */
        hal_dma_stop(adc_dev->p_dma_adc);

        /* reset DMA callback function interrupt handler */
        adc_dev->adc_dma.full_transcom_handle = NULL;
        adc_dev->adc_dma.half_transcom_handle = NULL;
        adc_dev->adc_dma.error_handle = NULL;

        /* set ADC state */
        _adc_state_clear(adc_dev, HAL_ADC_STATE_ROUTINE_BUSY);
        _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
        _adc_state_set(adc_dev, HAL_ADC_STATE_READY);
    } else {
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      initialize ADC inserted channel
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_ichannel: the pointer of ADC inserted sequence init structure
                  inserted_sequence_conversions: ENABLE, DISABLE
                  inserted_sequence_length: 1-4
                  inserted_sequence_external_trigger_select: inserted sequence trigger source
                  only one parameter can be selected which is shown as below:
      \arg          ADC_EXTTRIG_INSERTED_T0_TRGO: TIMER0 TRGO event select
      \arg          ADC_EXTTRIG_INSERTED_T0_CH3: TIMER0 CH3 event select
      \arg          ADC_EXTTRIG_INSERTED_T1_TRGO: TIMER1 TRGO event select
      \arg          ADC_EXTTRIG_INSERTED_T1_CH0: TIMER1 CH0 event select
      \arg          ADC_EXTTRIG_INSERTED_T2_CH3: TIMER2 CH3 event select
      \arg          ADC_EXTTRIG_INSERTED_T14_TRGO: TIMER14 TRGO event select
      \arg          ADC_EXTTRIG_INSERTED_EXTI_15: external interrupt line 15
      \arg          ADC_EXTTRIG_INSERTED_NONE: software trigger
                  auto_convert:
      \arg          ENABLE: enable auto convert
      \arg          DISABLE: disable auto convert
                  discontinuous_mode:
      \arg          ENABLE: enable discontinuous mode
      \arg          DISABLE: disable discontinuous mode
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_inserted_channel_config(hal_adc_dev_struct *adc_dev, hal_adc_inserted_config_struct *p_ichannel)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc_dev) || (NULL == p_ichannel)) {
        HAL_DEBUGE("pointer [adc_dev] or [p_iinit] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* ADC inserted channel initialize */
    if(ENABLE == p_ichannel->inserted_sequence_conversions) {
        /* ADC inserted channel length config */
        hals_adc_channel_length_config(ADC_INSERTED_CHANNEL, p_ichannel->inserted_sequence_length);

        /* ADC inserted channel external trigger config */
        hals_adc_external_trigger_source_config(ADC_INSERTED_CHANNEL,
                                                p_ichannel->inserted_sequence_external_trigger_select);

        /* ADC inserted channel sequence convert automatically config */
        if(ENABLE == p_ichannel->auto_convert) {
            if(ADC_EXTTRIG_INSERTED_NONE == p_ichannel->inserted_sequence_external_trigger_select) {
                hals_adc_special_function_config(ADC_INSERTED_CHANNEL_AUTO, p_ichannel->auto_convert);
            } else {
                _adc_error_set(adc_dev, HAL_ADC_ERROR_CONFIG);
                return HAL_ERR_NO_SUPPORT;
            }
        } else {
            ADC_CTL0 &= ~((uint32_t)ADC_CTL0_ICA);
        }

        /* ADC discontinuous mode config */
        if(ENABLE == p_ichannel->discontinuous_mode) {
            /* inserted discontinuous can be enabled only if auto-inserted mode is disabled.   */
            if(DISABLE == p_ichannel->auto_convert) {
                ADC_CTL0 |= (uint32_t)ADC_CTL0_DISIC;
            } else {
                _adc_error_set(adc_dev, HAL_ADC_ERROR_CONFIG);
                return HAL_ERR_NO_SUPPORT;
            }
        } else {
            ADC_CTL0 &= ~((uint32_t)ADC_CTL0_DISIC);
        }
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      configure ADC inserted rank
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irank: the pointer of ADC inserted channel configuration structure
                  channel: ADC_CHANNEL_x(x=0..18)
                  inserted_sequence:
                    the argument could be selected from enumeration <hal_adc_inserted_sequence_enum>
                  sampling_time: the sample time value
                  only one parameter can be selected which is shown as below:
      \arg          ADC_SAMPLETIME_1POINT5: 1.5 sampling cycles
      \arg          ADC_SAMPLETIME_7POINT5: 7.5 sampling cycles
      \arg          ADC_SAMPLETIME_13POINT5: 13.5 sampling cycles
      \arg          ADC_SAMPLETIME_28POINT5: 28.5 sampling cycles
      \arg          ADC_SAMPLETIME_41POINT5: 41.5 sampling cycles
      \arg          ADC_SAMPLETIME_55POINT5: 55.5 sampling cycles
      \arg          ADC_SAMPLETIME_71POINT5: 71.5 sampling cycles
      \arg          ADC_SAMPLETIME_239POINT5: 239.5 sampling cycles
                  data_offset: the offset data(0-0x0FFF)
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_inserted_rank_config(hal_adc_dev_struct *adc_dev, hal_adc_inserted_rank_config_struct *p_irank)
{
    uint32_t reg_temp;
    uint32_t length_temp;
    __IO uint32_t wait_loop = 0;
    uint8_t inserted_length;

