PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_adc.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc_dev) || (NULL == p_irank)) {
        HAL_DEBUGE("pointer [adc_dev] or [p_ichannel] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* ADC inserted channel length */
    length_temp = ((ADC_ISQ & ADC_ISQ_IL) >> 20U) + 1U;

    if(RESET == __HAL_ADC_GET_SCAN_MODE) {
        if(ADC_INSERTED_SEQUENCE_0 == p_irank->inserted_sequence) {
            /* ADC inserted channel config */
            hals_adc_inserted_channel_config(ADC_INSERTED_SEQUENCE_0, p_irank->channel, p_irank->sampling_time);
        } else {
            _adc_error_set(adc_dev, HAL_ADC_ERROR_CONFIG);
            return HAL_ERR_NO_SUPPORT;
        }
    } else {
        if(p_irank->inserted_sequence <= (length_temp - 1U)) {
            /* ADC inserted channel config */
            hals_adc_inserted_channel_config(p_irank->inserted_sequence, p_irank->channel,
                                             p_irank->sampling_time);
        } else {
            /* clear parameters */
            ADC_ISQ &= ~((uint32_t)ADC_ISQ_IL);

            inserted_length = (uint8_t)(length_temp - 1U);
            reg_temp = ADC_ISQ;
            reg_temp &= ~((uint32_t)(ADC_ISQ_ISQN << (15U - (inserted_length - (p_irank->inserted_sequence)) *
                                     5U)));
            ADC_ISQ = reg_temp;
        }
    }

    /* ADC inserted channel offset config */
    hals_adc_inserted_channel_offset_config(p_irank->inserted_sequence, p_irank->data_offset);

    /* enable temperature sensor and VREFINT measurement */
    if((ADC_CHANNEL_TEMPSENSOR == p_irank->channel) || (ADC_CHANNEL_VREFINT == p_irank->channel)) {
        if(RESET == __HAL_ADC_GET_TEMPVREF_ENABLE) {
            ADC_CTL1 |= ADC_CTL1_TSVREN;
            if(ADC_CHANNEL_TEMPSENSOR == p_irank->channel) {
                /* delay for temperature sensor stabilization time */
                /* compute number of CPU cycles to wait for */
                wait_loop = (ADC_TEMPSENSOR_DELAYTIME * (g_systemcoreclock / 1000000));
                while(wait_loop != 0) {
                    wait_loop--;
                }
            }
        }
    }
    /* enable backup battery voltage measurement */
    if(ADC_CHANNEL_BATTERY == p_irank->channel) {
        if(RESET == __HAL_ADC_GET_BATTERY_ENABLE) {
            /* enable the temperature sensor and Vrefint channel */
            ADC_CTL1 |= ADC_CTL1_VBETEN;
        }
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      enable ADC and start the conversion of inserted sequence
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_inserted_start(hal_adc_dev_struct *adc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* if ADC is enabled */
    if(HAL_ERR_NONE == _adc_enable(adc_dev)) {
        /* set ADC state  */
        _adc_state_clear(adc_dev, HAL_ADC_STATE_READY);
        _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_EOC);
        _adc_state_set(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
        /* check if a routine conversion is ongoing */
        if(RESET == ((hal_adc_state_get(adc_dev)) & HAL_ADC_STATE_ROUTINE_BUSY)) {
            adc_dev->error_state = HAL_ADC_ERROR_NONE;
        }

        /* clear ADC flag */
        hals_adc_flag_clear(ADC_FLAG_EOIC);

        if(RESET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV) {
            if(ADC_EXTTRIG_INSERTED_NONE == __HAL_ADC_GET_INSERTEDCH_EXTTRIGGER) {
                /* enable software trigger */
                hals_adc_external_trigger_config(ADC_INSERTED_CHANNEL, ENABLE);
                hals_adc_software_trigger_enable(ADC_INSERTED_CHANNEL);
            } else {
                /* enable external trigger */
                hals_adc_external_trigger_config(ADC_INSERTED_CHANNEL, ENABLE);
            }
        }
    } else {
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      stop the conversion of inserted sequence and disable ADC
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_inserted_stop(hal_adc_dev_struct *adc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* routine sequence is not busy and automatic convert is set */
    if((RESET == ((hal_adc_state_get(adc_dev)) & HAL_ADC_STATE_ROUTINE_BUSY)) &&
            (SET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV)) {
        /* if ADC is disabled */
        if(HAL_ERR_NONE == _adc_disable(adc_dev)) {
            /* set ADC state  */
            _adc_state_clear(adc_dev, HAL_ADC_STATE_ROUTINE_BUSY);
            _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
            _adc_state_set(adc_dev, HAL_ADC_STATE_READY);
        }
    } else {
        _adc_error_set(adc_dev, HAL_ADC_ERROR_CONFIG);
        return HAL_ERR_NO_SUPPORT;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      polling for ADC inserted sequence conversion, this function is just for single conversion
                (scan mode disabled or scan mode enabled with the length of inserted channel is 1).
    \param[in]  adc_dev: ADC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: time out duration in milliscond
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_inserted_conversion_poll(hal_adc_dev_struct *adc_dev, uint32_t timeout_ms)
{
    uint32_t tick_start = 0;

