PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_adc.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* lock ADC */
    HAL_LOCK(adc_dev);

    /* set timeout */
    tick_start = hal_sys_basetick_count_get();

    /* if single conversion: scan mode disabled or enabled with length = 1 */
    if((RESET == __HAL_ADC_GET_SCAN_MODE) && (RESET == __HAL_ADC_GET_INSERTEDCH_LENGTH)) {
        /* wait until end of inserted channel conversion flag is raised */
        while(RESET == hals_adc_flag_get(ADC_FLAG_EOIC)) {
            /* check for the timeout */
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    _adc_state_set(adc_dev, HAL_ADC_STATE_TIMEOUT);
                    /* when timeout occurs, output timeout warning message */
                    HAL_DEBUGW("adc_dev inserted conversion poll timeout");
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    } else {
        return HAL_ERR_NO_SUPPORT;
    }

    /* clear ADC EOIC/STIC/EOC flag */
    hals_adc_flag_clear(ADC_FLAG_EOIC);
    hals_adc_flag_clear(ADC_FLAG_STIC);
    hals_adc_flag_clear(ADC_FLAG_EOC);

    /* set ADC state */
    _adc_state_set(adc_dev, HAL_ADC_STATE_INSERTED_EOC);

    if((ADC_EXTTRIG_INSERTED_NONE == __HAL_ADC_GET_INSERTEDCH_EXTTRIGGER) ||
            ((RESET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV) \
             && ((ADC_EXTTRIG_ROUTINE_NONE == __HAL_ADC_GET_ROUTINECH_EXTTRIGGER) &&
                 (RESET == __HAL_ADC_GET_CONTINUOUS_MODE)))) {
        /* set ADC state */
        _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
        if(RESET == ((hal_adc_state_get(adc_dev)) & HAL_ADC_STATE_ROUTINE_BUSY)) {
            _adc_state_set(adc_dev, HAL_ADC_STATE_READY);
        }
    }
    /* unlock ADC */
    HAL_UNLOCK(adc_dev);

    return HAL_ERR_NONE;
}

/*!
    \brief      enable ADC inserted sequence software trigger
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_adc_inserted_software_trigger_enable(hal_adc_dev_struct *adc_dev)
{
    hals_adc_software_trigger_enable(ADC_INSERTED_CHANNEL);
}

/*!
    \brief      start ADC EOIC interrupt
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: EOIC interrupt callback function structure
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_inserted_start_interrupt(hal_adc_dev_struct *adc_dev, hal_adc_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [adc_dev] or [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* lock ADC */
    HAL_LOCK(adc_dev);

    /* if ADC is enabled */
    if(HAL_ERR_NONE == _adc_enable(adc_dev)) {
        _adc_state_clear(adc_dev, HAL_ADC_STATE_READY);
        _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_EOC);
        _adc_state_set(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);

        /* check if an inserted conversion is ongoing */
        if(RESET == ((hal_adc_state_get(adc_dev)) & HAL_ADC_STATE_ROUTINE_BUSY)) {
            adc_dev->error_state = HAL_ADC_ERROR_NONE;
        }

        adc_dev->adc_irq.adc_eoic_handle = p_irq->adc_eoic_handle;
        /* clear ADC interrupt flag */
        hals_adc_interrupt_flag_clear(ADC_INT_FLAG_EOIC);
        /* enable ADC end of sequence conversion flag */
        hals_adc_interrupt_enable(ADC_INT_EOIC);

        /* check if inserted sequence external trigger is enable*/
        if(RESET == ((ADC_CTL1) & (ADC_CTL1_ETEIC))) {
            /* enable software trigger */
            hals_adc_external_trigger_config(ADC_INSERTED_CHANNEL, ENABLE);
        }
        if(RESET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV) {
            if(ADC_EXTTRIG_INSERTED_NONE == __HAL_ADC_GET_INSERTEDCH_EXTTRIGGER) {
                /* enable software trigger */
                hals_adc_software_trigger_enable(ADC_INSERTED_CHANNEL);
            }
        }
    } else {
        return HAL_ERR_HARDWARE;
    }

    /* unlock ADC */
    HAL_UNLOCK(adc_dev);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop the conversion of inserted sequence and disable ADC
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_inserted_stop_interrupt(hal_adc_dev_struct *adc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* routine sequence is not busy and automatic convert is set */
    if((RESET == ((hal_adc_state_get(adc_dev)) & HAL_ADC_STATE_ROUTINE_BUSY)) &&
            (SET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV)) {
        /* if ADC is disabled */
        if(HAL_ERR_NONE == _adc_disable(adc_dev)) {
            /* disable end of inserted sequence conversion interrupt */
            hals_adc_interrupt_disable(ADC_INT_EOIC);
            adc_dev->adc_irq.adc_eoic_handle = NULL;

            /* set ADC state */;
            _adc_state_clear(adc_dev, HAL_ADC_STATE_ROUTINE_BUSY);
            _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
            _adc_state_set(adc_dev, HAL_ADC_STATE_READY);
        }
    } else {
        _adc_error_set(adc_dev, HAL_ADC_ERROR_CONFIG);
        return HAL_ERR_NO_SUPPORT;
    }

