PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_adc.c
    return HAL_ERR_NONE;
}

/*!
    \brief      configure watchdog
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_watchdog: the pointer of ADC watchdog configuration structure
                  routine_sequence_analog_watchdog:
      \arg          ENABLE: enable routine sequence analog watchdog
      \arg          DISABLE: disable routine sequence analog watchdog
                  inserted_sequence_analog_watchdog:
      \arg          ENABLE: enable inserted sequence analog watchdog
      \arg          DISABLE: disable inserted sequence analog watchdog
                  analog_watchdog_mode: ADC_WATCHDOG_MODE_ALL_CHANNELS, ADC_WATCHDOG_MODE_SINGLE_CHANNEL
      \arg          ADC_WATCHDOG_MODE_ALL_CHANNELS: Analog watchdog is effective on all channels
      \arg          ADC_WATCHDOG_MODE_SINGLE_CHANNEL: Analog watchdog is effective on a single channel
                  analog_watchdog_channel_select: ADC_CHANNEL_x(x=0..18)
                  analog_watchdog_low_threshold: analog watchdog low threshold, 0..4095
                  analog_watchdog_high_threshold: analog watchdog high threshold, 0..4095
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_watchdog_config(hal_adc_dev_struct *adc_dev, hal_adc_watchdog_config_struct *p_watchdog)
{
    uint32_t reg_temp;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc_dev) || (NULL == p_watchdog)) {
        HAL_DEBUGE("pointer [adc_dev] or [p_watchdog] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    reg_temp = ADC_CTL0;
    reg_temp &= (uint32_t)~(ADC_CTL0_RWDEN | ADC_CTL0_IWDEN | ADC_CTL0_WDSC);

    if(ENABLE == p_watchdog->routine_sequence_analog_watchdog) {
        reg_temp |= ADC_CTL0_RWDEN;
    }
    if(ENABLE == p_watchdog->inserted_sequence_analog_watchdog) {
        reg_temp |= ADC_CTL0_IWDEN;
    }
    if(ADC_WATCHDOG_MODE_SINGLE_CHANNEL == p_watchdog->analog_watchdog_mode) {
        reg_temp |= ADC_CTL0_WDSC;
        reg_temp &= (uint32_t)(~ADC_CTL0_WDCHSEL);
        reg_temp |= (uint32_t)(p_watchdog->analog_watchdog_channel_select);
    }
    ADC_CTL0 = reg_temp;

    /* ADC analog watchdog low threshold */
    ADC_WDLT = (uint32_t)WDLT_WDLT(p_watchdog->analog_watchdog_low_threshold);
    /* ADC analog watchdog high threshold */
    ADC_WDHT = (uint32_t)WDHT_WDHT(p_watchdog->analog_watchdog_high_threshold);

    return HAL_ERR_NONE;
}

/*!
    \brief      enable ADC watchdog interrupt
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: watchdog interrupt callback function structure
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_watchdog_interrupt_enable(hal_adc_dev_struct *adc_dev, hal_adc_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [adc_dev] or [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* ADC analog watchdog interrupt handle config */
    adc_dev->adc_irq.adc_watchdog_handle = p_irq->adc_watchdog_handle;
    /* clear ADC watchdog interrupt flag */
    hals_adc_interrupt_flag_clear(ADC_INT_FLAG_WDE);
    /* enable ADC watchdog interrupt */
    hals_adc_interrupt_enable(ADC_INT_WDE);

    return HAL_ERR_NONE;
}

/*!
    \brief      disable ADC watchdog interrupt
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_watchdog_interrupt_disable(hal_adc_dev_struct *adc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* disable ADC watchdog interrupt */
    hals_adc_interrupt_disable(ADC_INT_WDE);
    /* ADC analog watchdog interrupt handle config */
    adc_dev->adc_irq.adc_watchdog_handle = NULL;

    return HAL_ERR_NONE;
}

/*!
    \brief      polling for watchdog event
    \param[in]  adc_dev: ADC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: time out duration in milliscond
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
int32_t hal_adc_watchdog_event_poll(hal_adc_dev_struct *adc_dev, uint32_t timeout_ms)
{
    uint32_t tick_start = 0;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* set timeout */
    tick_start = hal_sys_basetick_count_get();

    /* check watchdog event flag */
    while(RESET == hals_adc_flag_get(ADC_FLAG_WDE)) {
        /* check for the timeout */
        if(HAL_TIMEOUT_FOREVER != timeout_ms) {
            if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                _adc_state_set(adc_dev, HAL_ADC_STATE_TIMEOUT);
                /* when timeout occurs, output timeout warning message */
                HAL_DEBUGW("adc_dev watchdog event poll timeout");
                return HAL_ERR_TIMEOUT;
            }
        }
    }

    /* set ADC state */
    _adc_state_set(adc_dev, HAL_ADC_STATE_WATCHDOG);

    /* clear ADC analog watchdog event flag */
    hals_adc_flag_clear(ADC_FLAG_WDE);

