PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_adc.c
    return HAL_ERR_NONE;
}

/*!
    \brief      ADC interrupt handler content function, which is merely used in ADC_CMP_IRQHandler
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_adc_irq(hal_adc_dev_struct *adc_dev)
{
    /* EOC interrupt handler */
    if(SET == (hals_adc_interrupt_flag_get(ADC_INT_FLAG_EOC))) {
        /* clear EOC flag */
        hals_adc_interrupt_flag_clear(ADC_INT_FLAG_EOC);
        if(NULL != (adc_dev->adc_irq.adc_eoc_handle)) {
            adc_dev->adc_irq.adc_eoc_handle(adc_dev);
        }
        /* if not in error state */
        if(SET == ((hal_adc_error_get(adc_dev)) & HAL_ADC_ERROR_SYSTEM)) {
            _adc_state_set(adc_dev, HAL_ADC_STATE_ROUTINE_EOC);
        }

        if((ADC_EXTTRIG_ROUTINE_NONE == __HAL_ADC_GET_ROUTINECH_EXTTRIGGER) &&
                (RESET == __HAL_ADC_GET_CONTINUOUS_MODE)) {
            hals_adc_interrupt_disable(ADC_INT_EOC);
            /* set ADC state */
            _adc_state_clear(adc_dev, HAL_ADC_STATE_ROUTINE_BUSY);
            if(RESET == ((hal_adc_state_get(adc_dev)) & HAL_ADC_STATE_INSERTED_BUSY)) {
                _adc_state_set(adc_dev, HAL_ADC_STATE_READY);
            }
        }
    }
    /* EOIC interrupt handler */
    if(SET == (hals_adc_interrupt_flag_get(ADC_INT_FLAG_EOIC))) {
        /* clear EOIC flag */
        hals_adc_interrupt_flag_clear(ADC_INT_FLAG_EOIC);
        if(NULL != (adc_dev->adc_irq.adc_eoic_handle)) {
            adc_dev->adc_irq.adc_eoic_handle(adc_dev);
        }
        /* if not in error state */
        if(SET == ((hal_adc_error_get(adc_dev)) & HAL_ADC_ERROR_SYSTEM)) {
            _adc_state_set(adc_dev, HAL_ADC_STATE_INSERTED_EOC);
        }

        if((ADC_EXTTRIG_INSERTED_NONE == __HAL_ADC_GET_INSERTEDCH_EXTTRIGGER) ||
                ((RESET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV) \
                 && ((ADC_EXTTRIG_ROUTINE_NONE == __HAL_ADC_GET_ROUTINECH_EXTTRIGGER) &&
                     (RESET == __HAL_ADC_GET_CONTINUOUS_MODE)))) {
            hals_adc_interrupt_disable(ADC_INT_EOIC);
            /* set ADC state */
            _adc_state_clear(adc_dev, HAL_ADC_STATE_INSERTED_BUSY);
            if(RESET == ((hal_adc_state_get(adc_dev)) & HAL_ADC_STATE_ROUTINE_BUSY)) {
                _adc_state_set(adc_dev, HAL_ADC_STATE_READY);
            }
        }
    }
    /* watchdog interrupt handler */
    if(SET == (hals_adc_interrupt_flag_get(ADC_INT_FLAG_WDE))) {
        /* clear watchdog flag */
        hals_adc_interrupt_flag_clear(ADC_INT_FLAG_WDE);
        if(NULL != (adc_dev->adc_irq.adc_watchdog_handle)) {
            adc_dev->adc_irq.adc_watchdog_handle(adc_dev);
        }
        /* set ADC state */
        _adc_state_set(adc_dev, HAL_ADC_STATE_WATCHDOG);
    }
}

/*!
    \brief      set user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to ADC interrupt callback functions structure
      \arg        hal_irq_handle_cb function pointer: the function is user-defined,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
      \arg        NULL: The corresponding callback mechanism is out of use, and
                    disable corresponding interrupt
      \arg        HAL_INTERRUPT_ENABLE_ONLY: The corresponding callback mechanism is out of use,
                    while enable corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_adc_irq_handle_set(hal_adc_dev_struct *adc_dev, hal_adc_irq_struct *p_irq)
{
    /* EOC interrupt handler set */
    if(NULL != p_irq->adc_eoc_handle) {
        adc_dev->adc_irq.adc_eoc_handle = p_irq->adc_eoc_handle;
        hals_adc_interrupt_enable(ADC_INT_EOC);
    } else {
        adc_dev->adc_irq.adc_eoc_handle = NULL;
        hals_adc_interrupt_enable(ADC_INT_EOC);
    }
    /* EOIC interrupt handler set */
    if(NULL != p_irq->adc_eoic_handle) {
        adc_dev->adc_irq.adc_eoic_handle = p_irq->adc_eoic_handle;
        hals_adc_interrupt_enable(ADC_INT_EOIC);
    } else {
        adc_dev->adc_irq.adc_eoic_handle = NULL;
        hals_adc_interrupt_disable(ADC_INT_EOIC);
    }
    /* watchdog interrupt handler set */
    if(NULL != p_irq->adc_watchdog_handle) {
        adc_dev->adc_irq.adc_watchdog_handle = p_irq->adc_watchdog_handle;
        hals_adc_interrupt_enable(ADC_INT_WDE);
    } else {
        adc_dev->adc_irq.adc_watchdog_handle = NULL;
        hals_adc_interrupt_disable(ADC_INT_WDE);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_adc_irq_handle_all_reset(hal_adc_dev_struct *adc_dev)
{
    /* ADC interrupt handler reset */
    adc_dev->adc_irq.adc_watchdog_handle = NULL;
    adc_dev->adc_irq.adc_eoc_handle      = NULL;
    adc_dev->adc_irq.adc_eoic_handle     = NULL;
}

/*!
    \brief      get ADC routine sequence conversion result
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the routine sequence conversion result(0-0xFFFF)
*/
uint16_t hal_adc_routine_value_get(hal_adc_dev_struct *adc_dev)
{
    /* return ADC routine sequence converted value */
    return ((uint16_t)ADC_RDATA);
}

/*!
    \brief      get ADC inserted sequence conversion result
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  inschannel_sequence: ADC inserted channel sequence
    \param[out] none
    \retval     the inserted sequence conversion result(0-0xFFFF)
*/
uint16_t hal_adc_inserted_value_get(hal_adc_dev_struct *adc_dev, uint8_t inschannel_sequence)
{
    uint16_t idata_temp = 0;

