PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_adc.c
    /* clear ADC interrupt flag */
    hals_adc_flag_clear(ADC_FLAG_EOIC);

    /* read ADC converted value */
    idata_temp = hals_adc_inserted_data_read(inschannel_sequence);

    /* return ADC converted value */
    return idata_temp;
}

/*!
    \brief      get ADC error
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the error state
*/
uint32_t hal_adc_error_get(hal_adc_dev_struct *adc_dev)
{
    /* return ADC error */
    return (adc_dev->error_state);
}

/*!
    \brief      get ADC state
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the state
*/
uint32_t hal_adc_state_get(hal_adc_dev_struct *adc_dev)
{
    /* return ADC state */
    return (adc_dev->state);
}

/*!
    \brief      enable the ADC
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
static int32_t _adc_enable(hal_adc_dev_struct *adc_dev)
{
    uint32_t tick_start = 0;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* if ADC is disabled */
    if(RESET == _adc_enable_state_get()) {
        /* enable ADC */
        hals_adc_enable();
        /* wait for ADC enable */
        hal_sys_basetick_delay_ms(1U);

        tick_start = hal_sys_basetick_count_get();

        /* wait for ADC actually enabled */
        while(RESET == _adc_enable_state_get()) {
            if(SET == hal_sys_basetick_timeout_check(tick_start, ADC_ENABLE_DELAYTIME)) {
                _adc_error_set(adc_dev, HAL_ADC_ERROR_SYSTEM);
                return HAL_ERR_TIMEOUT;
            }
        }
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      disable the ADC
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
static int32_t _adc_disable(hal_adc_dev_struct *adc_dev)
{
    uint32_t tick_start = 0;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc_dev) {
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* if ADC is not already disabled */
    if(RESET != _adc_enable_state_get()) {
        /* disable ADC */
        hals_adc_disable();

        /* wait for ADC disable */
        tick_start = hal_sys_basetick_count_get();

        /* wait for ADC actually disabled */
        while(RESET != _adc_enable_state_get()) {
            if(SET == hal_sys_basetick_timeout_check(tick_start, ADC_ENABLE_DELAYTIME)) {
                _adc_error_set(adc_dev, HAL_ADC_ERROR_SYSTEM);
                return HAL_ERR_TIMEOUT;
            }
        }
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      get ADC enable state
    \param[in]  adc_dev: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the enable state: SET or RESET
*/
static FlagStatus _adc_enable_state_get(void)
{
    if(0U != (ADC_CTL1 & ADC_CTL1_ADCON)) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      ADC DMA full transmission complete callback
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _adc_dma_full_transfer_complete(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_adc_dev_struct *p_adc;

    p_dma = (hal_dma_dev_struct *)dma;
    p_adc = (hal_adc_dev_struct *)(p_dma->p_periph);

    if(RESET == ((hal_adc_error_get(p_adc)) & (HAL_ADC_ERROR_DMA | HAL_ADC_ERROR_SYSTEM))) {
        /* set ADC state */
        _adc_state_set(p_adc, HAL_ADC_STATE_ROUTINE_EOC);

        if((ADC_EXTTRIG_ROUTINE_NONE == __HAL_ADC_GET_ROUTINECH_EXTTRIGGER) &&
                (DISABLE == __HAL_ADC_GET_CONTINUOUS_MODE)) {
            /* set ADC state */
            _adc_state_clear(p_adc, HAL_ADC_STATE_ROUTINE_BUSY);
            if(RESET == ((hal_adc_state_get(p_adc)) & HAL_ADC_STATE_INSERTED_BUSY)) {
                _adc_state_set(p_adc, HAL_ADC_STATE_READY);
            }
        }

        if(NULL != (p_adc->adc_dma.full_transcom_handle)) {
            p_adc->adc_dma.full_transcom_handle(p_adc);
        }
    }
}

/*!
    \brief      ADC DMA half transmission complete callback
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _adc_dma_half_transfer_complete(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_adc_dev_struct *p_adc;

    p_dma = (hal_dma_dev_struct *)dma;
    p_adc = (hal_adc_dev_struct *)(p_dma->p_periph);

    if(RESET == ((hal_adc_error_get(p_adc)) & (HAL_ADC_ERROR_DMA | HAL_ADC_ERROR_SYSTEM))) {
        /* set ADC state */
        _adc_state_set(p_adc, HAL_ADC_STATE_ROUTINE_EOC);

        if((ADC_EXTTRIG_ROUTINE_NONE == __HAL_ADC_GET_ROUTINECH_EXTTRIGGER) &&
                (DISABLE == __HAL_ADC_GET_CONTINUOUS_MODE)) {
            /* set ADC state */
            _adc_state_clear(p_adc, HAL_ADC_STATE_ROUTINE_BUSY);
            if(RESET == ((hal_adc_state_get(p_adc)) & HAL_ADC_STATE_INSERTED_BUSY)) {
                _adc_state_set(p_adc, HAL_ADC_STATE_READY);
            }
        }

        if(NULL != (p_adc->adc_dma.half_transcom_handle)) {
            p_adc->adc_dma.half_transcom_handle(p_adc);
        }
    }
}

/*!
    \brief      ADC DMA error callback
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _adc_dma_error(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_adc_dev_struct *p_adc;

    p_dma = (hal_dma_dev_struct *)dma;
    p_adc = (hal_adc_dev_struct *)p_dma->p_periph;

    if(NULL != (p_adc->adc_dma.error_handle)) {
        p_adc->adc_dma.error_handle(p_adc);
    }

    /* set ADC state and error */
    _adc_error_set(p_adc, HAL_ADC_ERROR_DMA);
}

/*!
    \brief      set ADC state
    \param[in]  d_adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  adc_state: the state of ADC
                  the argument could be selected from enumeration <hal_adc_state_enum>
    \param[out] none
    \retval     the ADC state
*/
static void _adc_state_set(hal_adc_dev_struct *d_adc, hal_adc_state_enum adc_state)
{
    /* set ADC state */
    d_adc->state |= (adc_state);
}

/*!
    \brief      clear ADC state
    \param[in]  d_adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  adc_state: the state of ADC
                  the argument could be selected from enumeration <hal_adc_state_enum>
    \param[out] none
    \retval     the ADC state
*/
static void _adc_state_clear(hal_adc_dev_struct *d_adc, hal_adc_state_enum adc_state)
{
    /* clear ADC state */
    d_adc->state &= ~(adc_state);
}

/*!
    \brief      set ADC error
    \param[in]  d_adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  adc_state: the state of ADC
                  the argument could be selected from enumeration <hal_adc_error_enum>
    \param[out] none
    \retval     the ADC error
*/
static void _adc_error_set(hal_adc_dev_struct *d_adc, hal_adc_error_enum adc_error)
{
    /* set ADC error */
    d_adc->error_state |= (adc_error);
}

/*!
    \brief      clear ADC error
    \param[in]  d_adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  adc_state: the state of ADC
                  the argument could be selected from enumeration <hal_adc_error_enum>
    \param[out] none
    \retval     the ADC error
*/
static void _adc_error_clear(hal_adc_dev_struct *d_adc, hal_adc_error_enum adc_error)
{
    /* clear ADC error */
    d_adc->error_state &= ~(adc_error);
}

/*!
    \brief      reset ADC
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_adc_deinit(void)
{
    hal_rcu_periph_reset_enable(RCU_ADCRST);
    hal_rcu_periph_reset_disable(RCU_ADCRST);
}

/*!
    \brief      enable ADC interface
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_adc_enable(void)
{
    if(RESET == (ADC_CTL1 & ADC_CTL1_ADCON)) {
        ADC_CTL1 |= (uint32_t)ADC_CTL1_ADCON;
    }
}

/*!
    \brief      disable ADC interface
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_adc_disable(void)
{
    ADC_CTL1 &= ~((uint32_t)ADC_CTL1_ADCON);
}

/*!
    \brief      ADC calibration and reset calibration
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_adc_calibration_enable(void)
{
    /* reset the selected ADC calibration register */
    ADC_CTL1 |= (uint32_t) ADC_CTL1_RSTCLB;
    /* check the RSTCLB bit state */
    while((ADC_CTL1 & ADC_CTL1_RSTCLB)) {
    }

    /* enable ADC calibration process */
    ADC_CTL1 |= ADC_CTL1_CLB;
    /* check the CLB bit state */
    while((ADC_CTL1 & ADC_CTL1_CLB)) {
    }
}

/*!
    \brief      enable DMA request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_adc_dma_mode_enable(void)
{
    ADC_CTL1 |= (uint32_t)(ADC_CTL1_DMA);
}

/*!
    \brief      disable DMA request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_adc_dma_mode_disable(void)
{
    ADC_CTL1 &= ~((uint32_t)ADC_CTL1_DMA);
}

/*!
    \brief      enable or disable ADC special function
    \param[in]  function: the function to configure
                one or more parameters can be selected which is shown as below:
      \arg        ADC_SCAN_MODE: scan mode select
      \arg        ADC_INSERTED_CHANNEL_AUTO: inserted channel convert automatically
      \arg        ADC_CONTINUOUS_MODE: continuous mode select
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void hals_adc_special_function_config(uint32_t function, ControlStatus newvalue)
{
    if(newvalue) {
        /* enable ADC scan mode */
        if(RESET != (function & ADC_SCAN_MODE)) {
            ADC_CTL0 |= ADC_SCAN_MODE;
        }
        /* enable ADC inserted channel convert automatically */
        if(RESET != (function & ADC_INSERTED_CHANNEL_AUTO)) {
            ADC_CTL0 |= ADC_INSERTED_CHANNEL_AUTO;
        }
        /* enable ADC continuous mode */
        if(RESET != (function & ADC_CONTINUOUS_MODE)) {
            ADC_CTL1 |= ADC_CONTINUOUS_MODE;
        }
    } else {
        /* disable ADC scan mode */
        if(RESET != (function & ADC_SCAN_MODE)) {
            ADC_CTL0 &= ~ADC_SCAN_MODE;
        }
        /* disable ADC inserted channel convert automatically */
        if(RESET != (function & ADC_INSERTED_CHANNEL_AUTO)) {
            ADC_CTL0 &= ~ADC_INSERTED_CHANNEL_AUTO;
        }
        /* disable ADC continuous mode */
        if(RESET != (function & ADC_CONTINUOUS_MODE)) {
            ADC_CTL1 &= ~ADC_CONTINUOUS_MODE;
        }
    }
}

/*!
    \brief      configure ADC data alignment
    \param[in]  data_alignment: data alignment select
                only one parameter can be selected which is shown as below:
      \arg        ADC_LSB_ALIGNMENT: LSB alignment
      \arg        ADC_MSB_ALIGNMENT: MSB alignment
    \param[out] none
    \retval     none
*/
void hals_adc_data_alignment_config(uint32_t data_alignment)
{
    if(ADC_LSB_ALIGNMENT != data_alignment) {
        ADC_CTL1 |= ADC_CTL1_DAL;
    } else {
        ADC_CTL1 &= ~((uint32_t)ADC_CTL1_DAL);
    }
}

/*!
    \brief      configure the length of routine channel sequence or inserted channel sequence
    \param[in]  channel_sequence: select the channel sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine channel sequence
      \arg        ADC_INSERTED_CHANNEL: inserted channel sequence
    \param[in]  length: the length of the channel
                        routine channel 1-16
                        inserted channel 1-4
    \param[out] none
    \retval     none
*/
void hals_adc_channel_length_config(uint8_t channel_sequence, uint32_t length)
{
    switch(channel_sequence) {
    case ADC_ROUTINE_CHANNEL:
        /* configure the length of routine channel sequence */
        ADC_RSQ0 &= ~((uint32_t)ADC_RSQ0_RL);
        ADC_RSQ0 |= RSQ0_RL((uint32_t)(length - 1U));
        break;
    case ADC_INSERTED_CHANNEL:
        /* configure the length of inserted channel sequence */
        ADC_ISQ &= ~((uint32_t)ADC_ISQ_IL);
        ADC_ISQ |= ISQ_IL((uint32_t)(length - 1U));
        break;
    default:
        break;
    }
}

/*!
    \brief      configure ADC routine channel
    \param[in]  rank: the argument could be selected from enumeration <hal_adc_routine_sequence_enum>
    \param[in]  channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_x(x=0..18): ADC Channelx
    \param[in]  sample_time: the sample time value
                only one parameter can be selected which is shown as below:
      \arg        ADC_SAMPLETIME_1POINT5: 1.5 cycles
      \arg        ADC_SAMPLETIME_7POINT5: 7.5 cycles
      \arg        ADC_SAMPLETIME_13POINT5: 13.5 cycles
      \arg        ADC_SAMPLETIME_28POINT5: 28.5 cycles
      \arg        ADC_SAMPLETIME_41POINT5: 41.5 cycles
      \arg        ADC_SAMPLETIME_55POINT5: 55.5 cycles
      \arg        ADC_SAMPLETIME_71POINT5: 71.5 cycles
      \arg        ADC_SAMPLETIME_239POINT5: 239.5 cycles
    \param[out] none
    \retval     none
*/
void hals_adc_routine_channel_config(uint8_t rank, uint8_t channel, uint32_t sample_time)
{
    uint32_t rsq, sampt;

    /* configure ADC routine sequence */
    if(rank < 6U) {
        rsq = ADC_RSQ2;
        rsq &=  ~((uint32_t)(ADC_RSQX_RSQN << (5U * rank)));
        rsq |= ((uint32_t)channel << (5U * rank));
        ADC_RSQ2 = rsq;
    } else if(rank < 12U) {
        rsq = ADC_RSQ1;
        rsq &= ~((uint32_t)(ADC_RSQX_RSQN << (5U * (rank - 6U))));
        rsq |= ((uint32_t)channel << (5U * (rank - 6U)));
        ADC_RSQ1 = rsq;
    } else if(rank < 16U) {
        rsq = ADC_RSQ0;
        rsq &= ~((uint32_t)(ADC_RSQX_RSQN << (5U * (rank - 12U))));
        rsq |= ((uint32_t)channel << (5U * (rank - 12U)));
        ADC_RSQ0 = rsq;
    } else {
    }

    /* configure ADC sampling time */
    if(channel < 10U) {
        sampt = ADC_SAMPT1;
        sampt &= ~((uint32_t)(ADC_SAMPTX_SPTN << (3U * channel)));
        sampt |= (uint32_t)(sample_time << (3U * channel));
        ADC_SAMPT1 = sampt;
    } else if(channel < 19U) {
        sampt = ADC_SAMPT0;
        sampt &= ~((uint32_t)(ADC_SAMPTX_SPTN << (3U * (channel - 10U))));
        sampt |= (uint32_t)(sample_time << (3U * (channel - 10U)));
        ADC_SAMPT0 = sampt;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure ADC inserted channel
    \param[in]  rank: the argument could be selected from enumeration <hal_adc_inserted_sequence_enum>
    \param[in]  channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_x(x=0..18): ADC Channelx
    \param[in]  sample_time: The sample time value
                only one parameter can be selected which is shown as below:
      \arg        ADC_SAMPLETIME_1POINT5: 1.5 cycles
      \arg        ADC_SAMPLETIME_7POINT5: 7.5 cycles
      \arg        ADC_SAMPLETIME_13POINT5: 13.5 cycles
      \arg        ADC_SAMPLETIME_28POINT5: 28.5 cycles
      \arg        ADC_SAMPLETIME_41POINT5: 41.5 cycles
      \arg        ADC_SAMPLETIME_55POINT5: 55.5 cycles
      \arg        ADC_SAMPLETIME_71POINT5: 71.5 cycles
      \arg        ADC_SAMPLETIME_239POINT5: 239.5 cycles
    \param[out] none
    \retval     none
*/
void hals_adc_inserted_channel_config(uint8_t rank, uint8_t channel, uint32_t sample_time)
{
    uint8_t inserted_length;
    uint32_t isq, sampt;

    inserted_length = (uint8_t)GET_BITS(ADC_ISQ, 20U, 21U);

    isq = ADC_ISQ;
    isq &= ~((uint32_t)(ADC_ISQ_ISQN << (15U - (inserted_length - rank) * 5U)));
    isq |= ((uint32_t)channel << (15U - (inserted_length - rank) * 5U));
    ADC_ISQ = isq;

    /* configure ADC sampling time */
    if(channel < 10U) {
        sampt = ADC_SAMPT1;
        sampt &= ~((uint32_t)(ADC_SAMPTX_SPTN << (3U * channel)));
        sampt |= (uint32_t) sample_time << (3U * channel);
        ADC_SAMPT1 = sampt;
    } else if(channel < 19U) {
        sampt = ADC_SAMPT0;
        sampt &= ~((uint32_t)(ADC_SAMPTX_SPTN << (3U * (channel - 10U))));
        sampt |= ((uint32_t)sample_time << (3U * (channel - 10U)));
        ADC_SAMPT0 = sampt;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure ADC inserted channel offset
    \param[in]  inserted_channel: insert channel select
                only one parameter can be selected which is shown as below:
      \arg        ADC_INSERTED_CHANNEL_0: ADC inserted channel 0
      \arg        ADC_INSERTED_CHANNEL_1: ADC inserted channel 1
      \arg        ADC_INSERTED_CHANNEL_2: ADC inserted channel 2
      \arg        ADC_INSERTED_CHANNEL_3: ADC inserted channel 3
    \param[in]  offset: the offset data
    \param[out] none
    \retval     none
*/
void hals_adc_inserted_channel_offset_config(uint8_t inserted_channel, uint16_t offset)
{
    uint8_t inserted_length;
    uint32_t num = 0U;

    inserted_length = (uint8_t)GET_BITS(ADC_ISQ, 20U, 21U);
    num = 3U - (inserted_length - inserted_channel);

    if(num <= 3U) {
        /* calculate the offset of the register */
        num = num * 4U;
        /* configure the offset of the selected channels */
        REG32((ADC) + 0x14U + num) = IOFFX_IOFF((uint32_t)offset);
    }
}

/*!
    \brief      enable or disable ADC external trigger
    \param[in]  channel_sequence: select the channel sequence
                one or more parameters can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine channel sequence
      \arg        ADC_INSERTED_CHANNEL: inserted channel sequence
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void hals_adc_external_trigger_config(uint8_t channel_sequence, ControlStatus newvalue)
{
    if(newvalue) {
        /* external trigger enable for routine channel */
        if(RESET != (channel_sequence & ADC_ROUTINE_CHANNEL)) {
            ADC_CTL1 |= ADC_CTL1_ETERC;
        }
        /* external trigger enable for inserted channel */
        if(RESET != (channel_sequence & ADC_INSERTED_CHANNEL)) {
            ADC_CTL1 |= ADC_CTL1_ETEIC;
        }
    } else {
        /* external trigger disable for routine channel */
        if(RESET != (channel_sequence & ADC_ROUTINE_CHANNEL)) {
            ADC_CTL1 &= ~ADC_CTL1_ETERC;
        }
        /* external trigger disable for inserted channel */
        if(RESET != (channel_sequence & ADC_INSERTED_CHANNEL)) {
            ADC_CTL1 &= ~ADC_CTL1_ETEIC;
        }
    }
}

/*!
    \brief      configure ADC external trigger source
    \param[in]  channel_sequence: select the channel sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine channel sequence
      \arg        ADC_INSERTED_CHANNEL: inserted channel sequence
    \param[in]  external_trigger_source: routine or inserted sequence trigger source
                only one parameter can be selected which is shown as below:
                for routine channel:
      \arg        ADC_EXTTRIG_ROUTINE_T0_CH0: TIMER0 CH0 event select
      \arg        ADC_EXTTRIG_ROUTINE_T0_CH1: TIMER0 CH1 event select
      \arg        ADC_EXTTRIG_ROUTINE_T0_CH2: TIMER0 CH2 event select
      \arg        ADC_EXTTRIG_ROUTINE_T1_CH1: TIMER1 CH1 event select
      \arg        ADC_EXTTRIG_ROUTINE_T2_TRGO: TIMER2 TRGO event select
      \arg        ADC_EXTTRIG_ROUTINE_T14_CH0:  TIMER14 CH0 event select
      \arg        ADC_EXTTRIG_ROUTINE_EXTI_11: external interrupt line 11
      \arg        ADC_EXTTRIG_ROUTINE_NONE: software trigger
                for inserted channel:
      \arg        ADC_EXTTRIG_INSERTED_T0_TRGO: TIMER0 TRGO event select
      \arg        ADC_EXTTRIG_INSERTED_T0_CH3: TIMER0 CH3 event select
      \arg        ADC_EXTTRIG_INSERTED_T1_TRGO: TIMER1 TRGO event select
      \arg        ADC_EXTTRIG_INSERTED_T1_CH0: TIMER1 CH0 event select
      \arg        ADC_EXTTRIG_INSERTED_T2_CH3: TIMER2 CH3 event select
      \arg        ADC_EXTTRIG_INSERTED_T14_TRGO: TIMER14 TRGO event select
      \arg        ADC_EXTTRIG_INSERTED_EXTI_15: external interrupt line 15
      \arg        ADC_EXTTRIG_INSERTED_NONE: software trigger
    \param[out] none
    \retval     none
*/
void hals_adc_external_trigger_source_config(uint8_t channel_sequence, uint32_t external_trigger_source)
{
    switch(channel_sequence) {
    case ADC_ROUTINE_CHANNEL:
        /* external trigger select for routine channel */
        ADC_CTL1 &= ~((uint32_t)ADC_CTL1_ETSRC);
        ADC_CTL1 |= (uint32_t)external_trigger_source;
        break;
    case ADC_INSERTED_CHANNEL:
        /* external trigger select for inserted channel */
        ADC_CTL1 &= ~((uint32_t)ADC_CTL1_ETSIC);
        ADC_CTL1 |= (uint32_t)external_trigger_source;
        break;
    default:
        break;
    }
}

